#### BuildingEnvelopeAnalyzer Members

---

|  |
| --- |
| BuildingEnvelopeAnalyzer Class   Methods   Properties   See Also |

The  BuildingEnvelopeAnalyzer  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new analyzer. |
| Public method | Dispose | Releases all resources used by the  BuildingEnvelopeAnalyzer |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetBoundingElements | Returns the collection of building elements exposed to the outside forming the building envelope. |
| Public method | GetBoundingElementsForSpaceVolume | Returns the collection of bounding building elements for an enclosed space volume. |
| Public method | GetCenterPointsForConnectedGridCellsInSpaceVolume | Returns the collection of connected cells in an enclosed space volume. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

BuildingEnvelopeAnalyzer Class

Autodesk.Revit.DB.Analysis Namespace